[
  {
    "index": "1.1",
    "chapter": "1",
    "thought": "1",
    "content_type": "",
    "original": "THE SUBJECT of this Essay is not the so-called Liberty of the Will, so unfortunately opposed to the misnamed doctrine of Philosophical Necessity; but Civil, or Social Liberty: the nature and limits of the power which can be legitimately exercised by society over the individual. A question seldom stated, and hardly ever discussed, in general terms, but which profoundly influences the practical controversies of the age by its latent presence, and is likely soon to make itself recognised as the vital question of the future. It is so far from being new, that, in a certain sense, it has divided mankind, almost from the remotest ages; but in the stage of progress into which the more civilized portions of the species have now entered, it presents itself under new conditions, and requires a different and more fundamental treatment.",
    "existing_refashioned": "This essay revisits a question that has been a constant tension throughout history: what are the proper limits of authority over the individual? As political structures, social dynamics, and technology evolve, these limits must be continually reassessed.",
    "existing_elegant": "The subject of this essay is not free will vs determinism but the Right limits of authority over individuals. A question as old as history, yet one that requires frequnect reconsideration as technology and society progress.",
    "existing_summary": "This is about the legitimacy of authority over individuals, not free will—a timeless issue that must be re-examined as society advances.",
    "existing_distilled": "Not free will, but what authority over individuals is just—and why progress forces us to revisit it.",
    "existing_notes": "This question is raised by Plato, and probably earlier, and various times over the course of history with various differences in the Right authority. Plato suggesting philosopher kings and noble lies to maintain a Just City to progress toward a better way of living."
  },
  {
    "index": "1.2",
    "chapter": "1",
    "thought": "2",
    "content_type": "",
    "original": "The struggle between Liberty and Authority is the most conspicuous feature in the portions of history with which we are earliest familiar, particularly in that of Greece, Rome, and England. But in old times this contest was between subjects, or some classes of subjects, and the Government. By liberty, was meant protection against the tyranny of the political rulers. The rulers were conceived (except in some of the popular governments of Greece) as in a necessarily antagonistic position to the people whom they ruled. They consisted of a governing One, or a governing tribe or caste, who derived their authority from inheritance or conquest, who, at all events, did not hold it at the pleasure of the governed, and whose supremacy men did not venture, perhaps did not desire, to contest, whatever precautions might be taken against its oppressive exercise. Their power was regarded as necessary, but also as highly dangerous; as a weapon which they would attempt to use against their subjects, no less than against external enemies. To prevent the weaker members of the community from being preyed on by innumerable vultures, it was needful that there should be an animal of prey stronger than the rest, commissioned to keep them down. But as the king of the vultures would be no less bent upon preying upon the flock than any of the minor harpies, it was indispensable to be in a perpetual attitude of defence against his beak and claws. The aim, therefore, of patriots was to set limits to the power which the ruler should be suffered to exercise over the community; and this limitation was what they meant by liberty. It was attempted in two ways.",
    "existing_refashioned": "Through most of history, the struggle between liberty and authority —whether in Greece, Rome, or England— was a struggle between the governed and their rulers. Liberty meant constraining rulers, who were assumed to stand in natural opposition to the people: a king, a caste, or a conquering group whose authority did not rest on the consent of the governed. Their power was seen as necessary to maintain order, yet it was also dangerous—the same force meant to preserve peace could shield corruption and suppress legitimate dissent. Limiting this power was the essence of what was called liberty, and it was pursued in two primary ways: recognized <b>Rights</b> and <b>Constitutional Checks.</b>",
    "existing_elegant": "The tension between liberty and authority runs through history, notably in Greece, Rome, and England. Authority, often rooted in conquest or inheritance, was tolerated for the order it provided, even as it preyed upon the people. To restrain it, and to guide rebellion, two principles were formed.",
    "existing_summary": "History shows a recurring struggle between liberty and authority. Rulers were necessary but exploitative, and two main principles arose to check their power.",
    "existing_distilled": "Liberty vs authority has long shaped history; rulers were both needed and dangerous, so two checks on their power emerged.",
    "existing_notes": "Model Parliment (1295), Magna Carta (1215),  Hungary’s Golden Bull (1222),"
  },
  {
    "index": "1.3",
    "chapter": "1",
    "thought": "3",
    "content_type": "",
    "original": "First, by obtaining a recognition of certain immunities, called political liberties or rights, which it was to be regarded as a breach of duty in the ruler to infringe, and which, if he did infringe, specific resistance, or general rebellion, was held to be justifiable.",
    "existing_refashioned": "<b>Rights</b> were the limits placed on authority, or the actions individuals were free to take without fear of punishment. These protections were often upheld through legal safeguards that prevented rulers from imposing unfair penalties. When authorities violated these rights and punished people for exercising them, resistance or even rebellion was seen as justified.",
    "existing_elegant": "The first safeguard was to win acknowledgment of defined rights. Should rulers violate them, resistance, even rebellion, was justified.",
    "existing_summary": "The first method was to establish human rights that, if violated by rulers, justified resistance or rebellion.",
    "existing_distilled": "People secured rights, and breaking rulers breaking them made resistance or rebellion justified",
    "existing_notes": "English Bill of Rights (1689)"
  },
  {
    "index": "1.4",
    "chapter": "1",
    "thought": "4",
    "content_type": "",
    "original": "A second, and generally a later expedient, was the establishment of constitutional checks, by which the consent of the community, or of a body of some sort, supposed to represent its interests, was made a necessary condition to some of the more important acts of the governing power.",
    "existing_refashioned": "<b>Constitutional Checks</b> are the mechanisms that require those in power to obtain the consent of the governed, or their representatives, before taking significant actions.",
    "existing_elegant": "The second constitutional checks, meaning key acts of rulers required the consent of the people, or a body representing them.",
    "existing_summary": "The second method was constitutional checks, ensuring major government actions needed community or representative approval.",
    "existing_distilled": "Secondly, constitutional checks forced rulers to gain consent for major acts.",
    "existing_notes": ""
  },
  {
    "index": "1.5",
    "chapter": "1",
    "thought": "5",
    "content_type": "",
    "original": "To the first of these modes of limitation, the ruling power, in most European countries, was compelled, more or less, to submit. It was not so with the second; and, to attain this, or when already in some degree possessed, to attain it more completely, became everywhere the principal object of the lovers of liberty. And so long as mankind were content to combat one enemy by another, and to be ruled by a master, on condition of being guaranteed more or less efficaciously against his tyranny, they did not carry their aspirations beyond this point.",
    "existing_refashioned": "In most European countries, rulers eventually accepted rights but resisted constitutional checks, so securing those checks became the central goal of advocates of liberty. At that time, people were still willing to be ruled by a stronger authority so long as its power was kept within limits.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.6",
    "chapter": "1",
    "thought": "6",
    "content_type": "",
    "original": "A time, however, came, in the progress of human affairs, when men ceased to think it a necessity of nature that their governors should be an independent power, opposed in interest to themselves. It appeared to them much better that the various magistrates of the State should be their tenants or delegates, revocable at their pleasure. In that way alone, it seemed, could they have complete security that the powers of government would never be abused to their disadvantage. By degrees this new demand for elective and temporary rulers became the prominent object of the exertions of the popular party, wherever any such party existed; and superseded, to a considerable extent, the previous efforts to limit the power of rulers. As the struggle proceeded for making the ruling power emanate from the periodical choice of the ruled, some persons began to think that too much importance had been attached to the limitation of the power itself. That (it might seem) was a resource against rulers whose interests were habitually opposed to those of the people. What was now wanted was, that the rulers should be identified with the people; that their interest and will should be the interest and will of the nation. The nation did not need to be protected against its own will. There was no fear of its tyrannizing over itself. Let the rulers be effectually responsible to it, promptly removable by it, and it could afford to trust them with power of which it could itself dictate the use to be made. Their power was but the nation’s own power, concentrated, and in a form convenient for exercise. This mode of thought, or rather perhaps of feeling, was common among the last generation of European liberalism, in the Continental section of which it still apparently predominates. Those who admit any limit to what a government may do, except in the case of such governments as they think ought not to exist, stand out as brilliant exceptions among the political thinkers of the Continent. A similar tone of sentiment might by this time have been prevalent in our own country, if the circumstances which for a time encouraged it, had continued unaltered.",
    "existing_refashioned": "However, as time passed, people no longer wanted their rulers to be an opposing force. They increasingly believed that officials should be chosen by the people, accountable to them, and removable at their pleasure. This shift made elected and temporary rulers the central aim of liberal reformers, often replacing earlier efforts to limit the power of government. As this ideal spread, many came to think that once government reflected the people’s will, further restraints were unnecessary. If the people directed the nation’s power, why fear misuse? Across most of Europe, this belief became dominant. Only a few thinkers argued that such governments still required limits. Britain diverged due to its unique political circumstances.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.7",
    "chapter": "1",
    "thought": "7",
    "content_type": "",
    "original": "But, in political and philosophical theories, as well as in persons, success discloses faults and infirmities which failure might have concealed from observation. The notion, that the people have no need to limit their power over themselves, might seem axiomatic, when popular government was a thing only dreamed about, or read of as having existed at some distant period of the past. Neither was that notion necessarily disturbed by such temporary aberrations as those of the French Revolution, the worst of which were the work of an usurping few, and which, in any case, belonged, not to the permanent working of popular institutions, but to a sudden and convulsive outbreak against monarchical and aristocratic despotism. In time, however, a democratic republic came to occupy a large portion of the earth’s surface, and made itself felt as one of the most powerful members of the community of nations; and elective and responsible government became subject to the observations and criticisms which wait upon a great existing fact. It was now perceived that such phrases as “self-government,” and “the power of the people over themselves,” do not express the true state of the case. The “people” who exercise the power are not always the same people with those over whom it is exercised; and the “self-government” spoken of is not the government of each by himself, but of each by all the rest. The will of the people, moreover, practically means the will of the most numerous or the most active\npart of the people; the majority, or those who succeed in making themselves accepted as the majority; the people, consequently,\nmay desire to oppress a part of their number; and precautions are as much needed against this as against any other abuse of power. The limitation, therefore, of the power of government over individuals loses none of its importance when the holders of power are regularly accountable to the community, that is, to the strongest party therein. This view of things, recommending itself equally to the intelligence of thinkers and to the inclination of those important classes in European society to whose real or supposed interests democracy is adverse, has had no difficulty in establishing itself; and in political speculations “the tyranny of the majority” is now generally included among the evils against which society requires to be on its guard.",
    "existing_refashioned": "Experience eventually revealed the flaw in this way of thinking. It was an understandable error while democratic republics remained theoretical or belonged only to ancient history, but it became impossible to maintain once they appeared in practice. The people who rule are never the whole people, but the majority—or those who succeed in presenting themselves as such—and the power they wield through the state, whether physical or financial, can weigh as heavily on dissenting individuals as the authority of any monarch. An elected government does not eliminate the need for limits on power, expressed in the rights of individuals; if anything, it underscores how vital those limits are.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.8",
    "chapter": "1",
    "thought": "8",
    "content_type": "",
    "original": "Like other tyrannies, the tyranny of the majority was at first, and is still vulgarly, held in dread, chiefly as operating through the acts of the public authorities. But reflecting persons perceived that when society is itself the tyrant—society collectively, over the separate individuals who compose it—its means of tyrannizing are not restricted to the acts which it may do by the hands of its political functionaries. Society can and does execute its own mandates: and if it issues wrong mandates instead of right, or any mandates at all in things with which it ought not to meddle, it practises a social tyranny more formidable than many kinds of political oppression, since, though not usually upheld by such extreme penalties, it leaves fewer means of escape, penetrating much more deeply into the details of life, and enslaving the soul itself. Protection, therefore, against the tyranny of the magistrate is not enough: there needs protection also against the tyranny of the prevailing opinion and feeling; against the tendency of society to impose, by other means than civil penalties, its own ideas and practices as rules of conduct on those who dissent from them; to fetter the development, and, if possible, prevent the formation, of any individuality not in harmony with its ways, and compel all characters to fashion themselves upon the model of its own. There is a limit to the legitimate interference of collective opinion with individual independence: and to find that limit, and maintain it against encroachment, is as indispensable to a good condition of human affairs, as protection against political despotism.",
    "existing_refashioned": "As government is only one channel through which power operates, society can exert a quieter but often more intrusive form of domination even where physical force and fiscal threat are kept in check. Social pressure may not rely on legal penalties, but it penetrates more deeply into daily life and leaves fewer avenues of escape. It can impose prevailing ideas, customs, and expectations on those who diverge, stifling individuality before it has the chance to form. Protecting liberty therefore requires more than constitutional limits: it demands a boundary on the authority of collective sentiment, and vigilance in maintaining that boundary, so individuals remain free to develop their capacity to reason and pursue their own happiness.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.9",
    "chapter": "1",
    "thought": "9",
    "content_type": "",
    "original": "But though this proposition is not likely to be contested in general terms, the practical question, where to place the limit—how to make the fitting adjustment between individual independence and social control—is a subject on which nearly everything remains to be done. All that makes existence valuable to any one, depends on the enforcement of restraints upon the actions of other people. Some rules of conduct, therefore, must be imposed, by law in the first place, and by opinion on many things which are not fit subjects for the operation of law. What these rules should be, is the principal question in human affairs; but if we except a few of the most obvious cases, it is one of those which least progress has been made in resolving. No two ages, and scarcely any two countries, have decided it alike; and the decision of one age or country is a wonder to another.",
    "existing_refashioned": "Still, humanity’s ability to thrive depends on restraining the harmful actions of individuals, sometimes through law and, where law is unsuitable, through the pressure of social opinion. Yet beyond a few obvious cases, almost no agreement exists about what conduct society may rightfully restrict. No two ages, and scarcely any two countries, have drawn this boundary in the same place, and each is astonished by the judgments of the other.\n\nThus, one of the foundational questions of human affairs remains largely unanswered: how should we, as a society, determine the proper limits between individual freedom and collective control, in other words, who should be allowed to do what?",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.10",
    "chapter": "1",
    "thought": "10",
    "content_type": "",
    "original": "Yet the people of any given age and country no more suspect any difficulty in it, than if it were a subject on which mankind had always been agreed. The rules which obtain among themselves appear to them self-evident and self-justifying. This all but universal illusion is one of the examples of the magical influence of custom, which is not only, as the proverb says, a second nature, but is continually mistaken for the first. The effect of custom, in preventing any misgiving respecting the rules of conduct which mankind impose on one another, is all the more complete because the subject is one on which it is not generally considered necessary that reasons should be given, either by one person to others, or by each to himself. People are accustomed to believe, and have been encouraged in the belief by some who aspire to the character of philosophers, that their feelings, on subjects of this nature, are better than reasons, and render reasons unnecessary.",
    "existing_refashioned": "Yet people rarely notice how unsettled the issue truly is. The norms of any given era feel obvious and self-justifying, as if they expressed some natural truth about the right way to live. Custom becomes so ingrained that it is mistaken for human nature itself, and the possibility of questioning it barely occurs. Because these social rules feel unquestionable, people seldom think they need reasons for them, either when explaining them to others or when examining their own beliefs. Many grow accustomed to believing - often with encouragement from poor authorities - that their feelings, on subjects of this nature, are better than reasons, and render reasons unnecessary.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.11",
    "chapter": "1",
    "thought": "11",
    "content_type": "",
    "original": "The practical principle which guides them to their opinions on the regulation of human conduct, is the feeling in each person’s mind that everybody should be required to act as he, and those with whom he sympathizes, would like them to act. No one, indeed, acknowledges to himself that his standard of judgment is his own liking; but an opinion on a point of conduct, not supported by reasons, can only count as one person’s preference; and if the reasons, when given, are a mere appeal to a similar preference felt by other people, it is still only many people’s liking instead of one. To an ordinary man, however, his own preference, thus supported, is not only a perfectly satisfactory reason, but the only one he generally has for any of his notions of morality, taste, or propriety, which are not expressly written in his religious creed; and his chief guide in the interpretation even of that. Men’s opinions, accordingly, on what is laudable or blameable, are affected by all the multifarious causes which influence their wishes in regard to the conduct of others, and which are as numerous as those which determine their wishes on any other subject.",
    "existing_refashioned": "However, an unexamined feeling is only a pershow thonal preference, and even when shared by many, it remains only the preference of a group. What often passes for moral judgment is simply the belief that others should act as the person judging wishes them to. For most people, such preferences are the only basis for deciding what is admirable or blameworthy, except where a rule is explicitly tied to religious doctrine. And even then, their understanding of that doctrine is usually shaped by the same unexamined feelings.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.12",
    "chapter": "1",
    "thought": "12",
    "content_type": "",
    "original": "Sometimes their reason—at other times their prejudices or superstitions: often their social affections, not seldom their antisocial ones, their envy or jealousy, their arrogance or contemptuousness: but most commonly, their desires or fears for themselves—their legitimate or illegitimate self-interest. Wherever there is an ascendant class, a large portion of the morality of the country emanates from its class interests, and its feelings of class superiority. The morality between Spartans and Helots, between planters and negroes, between princes and subjects, between nobles and roturiers, between men and women, has been for the most part the creation of these class interests and feelings: and the sentiments thus generated, react in turn upon the moral feelings of the members of the ascendant class, in their relations among themselves. Where, on the other hand, a class, formerly ascendant, has lost its ascendancy, or where its ascendancy is unpopular, the prevailing moral sentiments frequently bear the impress of an impatient dislike of superiority.",
    "existing_refashioned": "In practice, what society calls moral authority rarely arises from reason. The customs treated as moral truth usually grow out of prejudice, superstition, affection, resentment, fear, self-interest, or from the emotional weight people attach to what they believe earthly rulers or divine powers demand. These impulses create genuine feelings of approval and condemnation; they once led communities to persecute alleged witches and burn heretics.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.13",
    "chapter": "1",
    "thought": "13",
    "content_type": "",
    "original": "Another grand determining principle of the rules of conduct, both in act and forbearance, which have been enforced by law or opinion, has been the servility of mankind towards the supposed preferences or aversions of their temporal masters, or of their gods. This servility, though essentially selfish, is not hypocrisy; it gives rise to perfectly genuine sentiments of abhorrence; it made men burn magicians and heretics. Among so many baser influences, the general and obvious interests of society have of course had a share, and a large one, in the direction of the moral sentiments: less, however, as a matter of reason, and on their own account, than as a consequence of the sympathies and antipathies which grew out of them: and sympathies and antipathies which had little or nothing to do with the interests of society, have made themselves felt in the establishment of moralities with quite as great force.",
    "existing_refashioned": "Class power has been an equally influential source of the customs regarded as moral. Wherever a dominant group exists, much of the customary opinions on morality reflect its interests and its sense of superiority. The relations between Spartans and Helots, planters and enslaved people, nobles and commoners, the wealthy and those who labor for them, princes and subjects, men and women—all bore the imprint of class advantage. When a ruling group loses authority or its position becomes unpopular, the customs treated as moral often shift in the opposite direction, expressing resentment toward the former hierarchy rather than any principled reconsideration.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.14",
    "chapter": "1",
    "thought": "14",
    "content_type": "",
    "original": "The likings and dislikings of society, or of some powerful portion of it, are thus the main thing which has practically determined the rules laid down for general observance, under the penalties of law or opinion. And in general, those who have been in advance of society in thought and feeling, have left this condition of things unassailed in principle, however they may have come into conflict with it in some of its details. They have occupied themselves rather in inquiring what things society ought to like or dislike, than in questioning whether its likings or dislikings should be a law to individuals. They preferred endeavouring to alter the feelings of mankind on the particular points on which they were themselves heretical, rather than make common cause in defence of freedom, with heretics generally. The only case in which the higher ground has been taken on principle and maintained with consistency, by any but an individual here and there, is that of religious belief: a case instructive in many ways, and not least so as forming a most striking instance of the fallibility of what is called the moral sense: for the\nodium theologicum, in a sincere bigot, is one of the most unequivocal cases of moral feeling. Those who first broke the yoke of what called itself the Universal Church, were in general as little willing to permit difference of religious opinion as that church itself. But when the heat of the conflict was over, without giving a complete victory to any party, and each church or sect was reduced to limit its hopes to retaining possession of the ground it already occupied; minorities, seeing that they had no chance of becoming majorities, were under the necessity of pleading to those whom they could not convert, for permission to differ. It is accordingly on this battle field, almost solely, that the rights of the individual against society have been asserted on broad grounds of principle, and the claim of society to exercise authority over dissentients, openly controverted. The great writers to whom the world owes what religious liberty it possesses, have mostly asserted freedom of conscience as an indefeasible right, and denied absolutely that a human being is accountable to others for his religious belief. Yet so natural to mankind is intolerance in whatever they really care about, that religious freedom has hardly anywhere been practically realized, except where religious indifference, which dislikes to have its peace disturbed by theological quarrels, has added its weight to the scale. In the minds of almost all religious persons, even in the most tolerant countries, the duty of toleration is admitted with tacit reserves. One person will bear with dissent in matters of church government, but not of dogma; another can tolerate everybody, short of a Papist or an Unitarian; another, every one who believes in revealed religion; a few extend their charity a little further, but stop at the belief in a God and in a future state. Wherever the sentiment of the majority is still genuine and intense, it is found to have abated little of its claim to be obeyed.",
    "existing_refashioned": "Appeals to the public good have shaped moral customs less through argument than through unexamined sentiment. These sentiments, often unrelated to society’s real interests, nonetheless carry enough weight to define what people call moral, and they often outweigh the authority that reason should have.\n\nEven forward-thinking reformers seldom question the deeper assumption that society’s preferences, whatever their source, deserve moral or legal authority. Instead of defending a general freedom to differ or standing with other dissenters, they focus only on persuading society to adjust the particular customs they themselves oppose. They seek to refine specific norms, not to challenge the idea that collective feeling should govern individual conduct.\n\nReligion has been the one major sphere in which people have defended on principle an individual’s right to differ from the rest of society. This defense emerged only after long conflict and deep hostility among sects, and only because no single faction succeeded in securing unquestioned dominance. Faced with stalemate, each was forced to tolerate those it could not defeat, and minorities, seeing no hope of becoming majorities, had no option but to appeal for the freedom to differ. Yet genuine tolerance has rarely been realized in practice. Even in the most liberal countries, acceptance of religious difference is often grudging and qualified. One person tolerates disagreement in church governance but not doctrine; another everyone except Catholics or Unitarians; another only those who affirm revealed religion; a few extend tolerance slightly further but still insist on belief in God and in some form of life after death. Wherever conviction remains strong, the majority’s expectation of obedience scarcely diminishes.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.15",
    "chapter": "1",
    "thought": "15",
    "content_type": "",
    "original": "In England, from the peculiar circumstances of our political history, though the yoke of opinion is perhaps heavier, that of law is lighter, than in most other countries of Europe; and there is considerable jealousy of direct interference, by the legislative or the executive power, with private conduct; not so much from any just regard for the independence of the individual, as from the still subsisting habit of looking on the government as representing an opposite interest to the public. The majority have not yet learnt to feel the power of the government their power, or its opinions their opinions. When they do so, individual liberty will probably be as much exposed to invasion from the government, as it already is from public opinion. But, as yet, there is a considerable amount of feeling ready to be called forth against any attempt of the law to control individuals in things in which they have not hitherto been accustomed to be controlled by it; and this with very little discrimination as to whether the matter is, or is not, within the legitimate sphere of legal control; insomuch that the feeling, highly salutary on the whole, is perhaps quite as often misplaced as well grounded in the particular instances of its application. There is, in fact, no recognised principle by which the propriety or impropriety of government interference is customarily tested. People decide according to their personal preferences. Some, whenever they see any good to be done, or evil to be remedied, would willingly instigate the government to undertake the business; while others prefer to bear almost any amount of social evil, rather than add one to the departments of human interests amenable to governmental control. And men range themselves on one or the other side in any particular case, according to this general direction of their sentiments; or according to the degree of interest which they feel in the particular thing which it is proposed that the government should do, or according to the belief they entertain that the government would, or would not, do it in the manner they prefer; but very rarely on account of any opinion to which they consistently adhere, as to what things are fit to be done by a government. And it seems to me that in consequence of this absence of rule or principle, one side is at present as often wrong as the other; the interference of government is, with about equal frequency, improperly invoked and improperly condemned.",
    "existing_refashioned": "In practice, societies still lack a clear principle for deciding when government should intervene in the lives of individuals. People resist or welcome interference based not on any consistent standard, but on habit, temperament, or personal interest. Some call for government action whenever they see a social good to be achieved or a harm to be prevented. Others would rather endure almost any problem than expand the reach of state authority. In each case, support or opposition depends less on reasoned conviction than on sentiment, convenience, or trust in how the government might act.\n\nBecause no shared principle guides these judgments, government interference is as often invoked where it is unwarranted as rejected where it is justified. The boundaries of individual liberty are therefore drawn inconsistently, shifting with public feeling rather than with any stable understanding of what society may rightfully control.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.16",
    "chapter": "1",
    "thought": "16",
    "content_type": "",
    "original": "The object of this Essay is to assert one very simple principle, as entitled to govern absolutely the dealings of society with the individual in the way of compulsion and control, whether the means used be physical force in the form of legal penalties, or the moral coercion of public opinion. That principle is, that the sole end for which mankind are warranted, individually or collectively, in interfering with the liberty of action of any of their number, is self-protection. That the only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others. His own good, either physical or moral, is not a sufficient warrant. He cannot rightfully be compelled to do or forbear because it will be better for him to do so, because it will make him happier, because, in the opinions of others, to do so would be wise, or even right. These are good reasons for remonstrating with him, or reasoning with him, or persuading him, or entreating him, but not for compelling him, or visiting him with any evil in case he do otherwise. To justify that, the conduct from which it is desired to deter him, must be calculated to produce evil to some one else. The only part of the conduct of any one, for which he is amenable to society, is that which concerns others. In the part which merely concerns himself, his independence is, of right, absolute. Over himself, over his own body and mind, the individual is sovereign.",
    "existing_refashioned": "The aim of this essay is to defend one principle that should govern all limits of authority. An individual’s liberty may be constrained only for the sake of protecting others from harm. This applies whether coercion is exercised by an individual or by society as a whole, and whether the means are legal penalties, physical force, or the moral pressure of public opinion.\n\nA person’s own good, whether physical or moral, is never a sufficient reason to restrict their liberty. No one may be compelled to act, or to refrain from acting, because others believe it would benefit them, make them happier, or be wiser or more virtuous. Such considerations may justify advice, persuasion, or appeal, but never force or punishment. Coercion requires that the conduct in question pose a genuine threat of harm to someone else.\n\nThe individual is accountable to society only for actions that affect others. In all that concerns only themselves, their freedom is, by right, absolute. Over their own body and mind, each person is sovereign.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.17",
    "chapter": "1",
    "thought": "17",
    "content_type": "",
    "original": "It is, perhaps, hardly necessary to say that this doctrine is meant to apply only to human beings in the maturity of their faculties. We are not speaking of children, or of young persons below the age which the law may fix as that of manhood or womanhood. Those who are still in a state to require being taken care of by others, must be protected against their own actions as well as against external injury. For the same reason, we may leave out of consideration those backward states of society in which the race itself may be considered as in its nonage. The early difficulties in the way of spontaneous progress are so great, that there is seldom any choice of means for overcoming them; and a ruler full of the spirit of improvement is warranted in the use of any expedients that will attain an end, perhaps otherwise unattainable. Despotism is a legitimate mode of government in dealing with barbarians, provided the end be their improvement, and the means justified by actually effecting that end. Liberty, as a principle, has no application to any state of things anterior to the time when mankind have become capable of being improved by free and equal discussion. Until then, there is nothing for them but implicit obedience to an Akbar or a Charlemagne, if they are so fortunate as to find one. But as soon as mankind have attained the capacity of being guided to their own improvement by conviction or persuasion (a period long since reached in all nations with whom we need here concern ourselves), compulsion, either in the direct form or in that of pains and penalties for non-compliance, is no longer admissible as a means to their own good, and justifiable only for the security of others.",
    "existing_refashioned": "This principle applies only to adults in full possession of their faculties. It does not extend to children or those  as not yet capable of directing their own lives. Those who remain dependent on others must be protected not only from external harm but also from actions that would endanger their own well-being.\n\nIt likewise does not apply to societies still in an early stage of development. Where the obstacles to progress are immense and self-directed improvement is not yet possible, rulers may be justified in using whatever means are necessary to achieve ends that could not otherwise be attained. In such conditions, despotism can be a legitimate form of government—if its purpose is the improvement of the population and its methods genuinely achieve that aim. Liberty, as a principle, becomes relevant only once people have developed the capacity to benefit from free and equal discussion. Before that point, their situation admits of no alternative but obedience to a capable and benevolent authority, should they be fortunate enough to have one.\n\nBut once a society has reached the stage where individuals can be guided by reason (a condition long since achieved in all communities with which this essay is concerned), compulsion can no longer be justified for a person’s own good. From that point onward, interference is warranted only to protect others from harm.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.18",
    "chapter": "1",
    "thought": "18",
    "content_type": "",
    "original": "It is proper to state that I forego any advantage which could be derived to my argument from the idea of abstract right, as a thing independent of utility. I regard utility as the ultimate appeal on all ethical questions; but it must be utility in the largest sense, grounded on the permanent interests of man as a progressive being. Those interests, I contend, authorize the subjection of individual spontaneity to external control, only in respect to those actions of each, which concern the interest of other people. If any one does an act hurtful to others, there is a\nprimâ facie case for punishing him, by law, or, where legal penalties are not safely applicable, by general disapprobation. There are also many positive acts for the benefit of others, which he may rightfully be compelled to perform; such as, to give evidence in a court of justice; to bear his fair share in the common defence, or in any other joint work necessary to the interest of the society of which he enjoys the protection; and to perform certain acts of individual beneficence, such as saving a fellow-creature’s life, or interposing to protect the defenceless against ill-usage, things which whenever it is obviously a man’s duty to do, he may rightfully be made responsible to society for not doing. A person may cause evil to others not only by his actions but by his inaction, and in either case he is justly accountable to them for the injury. The latter case, it is true, requires a much more cautious exercise of compulsion than the former. To make any one answerable for doing evil to others, is the rule; to make him answerable for not preventing evil, is, comparatively speaking, the exception. Yet there are many cases clear enough and grave enough to justify that exception. In all things which regard the external relations of the individual, he is\nde jure amenable to those whose interests are concerned, and if need be, to society as their protector. There are often good reasons for not holding him to the responsibility; but these reasons must arise from the special expediencies of the case: either because it is a kind of case in which he is on the whole likely to act better, when left to his own discretion, than when controlled in any way in which society have it in their power to control him; or because the attempt to exercise control would produce other evils, greater than those which it would prevent. When such reasons as these preclude the enforcement of responsibility, the conscience of the agent himself should step into the vacant judgment seat, and protect those interests of others which have no external protection; judging himself all the more rigidly, because the case does not admit of his being made accountable to the judgment of his fellow-creatures.",
    "existing_refashioned": "I do not argue that the right way to live is independent of utility. Utility, understood in the broad sense of the long-term interests of humans as progressive beings, is the ultimate appeal in these matters.\n\nWhen one person harms another, there is a clear case for holding them accountable—whether through law, financial penalties, or, where those are unsuitable, social pressure.\n\nThere are also obligations to the collective that may rightly be enforced: giving evidence in court, contributing one’s fair share to defense or other essential public work, and performing obvious acts of beneficence, such as saving a life or protecting someone from abuse.\n\nA person may harm others by action or by inaction, and in either case may be justly answerable. But coercion for inaction requires far greater caution. Holding someone responsible for causing harm is the rule; holding them responsible for failing to prevent harm is the exception, though at times a necessary one.\n\nIn all matters where an individual’s conduct affects others, they are, in principle, accountable to those affected and, if needed, to society acting on their behalf. There may be good reasons not to enforce that responsibility: a person may act better when left to their own judgment, or attempts at control may produce greater harm than they prevent. Such reasons depend on circumstance, not on a denial of society’s authority.\n\nWhere society cannot rightfully impose accountability, the individual’s own conscience must take its place, judging their actions and omissions more strictly precisely because no public judgment is possible.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.19",
    "chapter": "1",
    "thought": "19",
    "content_type": "",
    "original": "But there is a sphere of action in which society, as distinguished from the individual, has, if any, only an indirect interest; comprehending all that portion of a person’s life and conduct which affects only himself, or if it also affects others, only with their free, voluntary, and undeceived consent and participation. When I say only himself, I mean directly, and in the first instance: for whatever affects himself, may affect others through himself; and the objection which may be grounded on this contingency, will receive consideration in the sequel. This, then, is the appropriate region of human liberty. It comprises, first, the inward domain of consciousness; demanding liberty of conscience, in the most comprehensive sense; liberty of thought and feeling; absolute freedom of opinion and sentiment on all subjects, practical or speculative, scientific, moral, or theological. The liberty of expressing and publishing opinions may seem to fall under a different principle, since it belongs to that part of the conduct of an individual which concerns other people; but, being almost of as much importance as the liberty of thought itself, and resting in great part on the same reasons, is practically inseparable from it. Secondly, the principle requires liberty of tastes and pursuits; of framing the plan of our life to suit our own character; of doing as we like, subject to such consequences as may follow: without impediment from our fellow-creatures, so long as what we do does not harm them, even though they should think our conduct foolish, perverse, or wrong. Thirdly, from this liberty of each individual, follows the liberty, within the same limits, of combination among individuals; freedom to unite, for any purpose not involving harm to others: the persons combining being supposed to be of full age, and not forced or deceived.",
    "existing_refashioned": "Our freedom of thought and personal preference is the proper domain of realized liberty. Society may have an indirect stake in these matters, since how a person thinks or behaves, even when harmless now, could influence future actions. But individuals must remain free to hold any belief or opinion on any subject.\n\nFreedom of thought is inseparable from freedom of expression. Even though expression involves others, the liberty to speak and publish one’s views is just as important as the liberty to think them. In practice, the two freedoms stand or fall together.\n\nPersonal preferences also vary widely, and liberty requires the ability to shape one’s own character and to act according to one’s own judgment so long as no one is harmed. Even when others find a person’s choices misguided or wrong, those choices should remain protected.\n\nThe same principle extends to voluntary association. Just as expression follows from thought, the freedom to unite follows from individual preference. People should be free to join with others for any purpose that does not harm anyone outside the association, provided all participants act willingly.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.20",
    "chapter": "1",
    "thought": "20",
    "content_type": "",
    "original": "No society in which these liberties are not, on the whole, respected, is free, whatever may be its form of government; and none is completely free in which they do not exist absolute and unqualified. The only freedom which deserves the name, is that of pursuing our own good in our own way, so long as we do not attempt to deprive others of theirs, or impede their efforts to obtain it. Each is the proper guardian of his own health, whether bodily, or mental and spiritual. Mankind are greater gainers by suffering each other to live as seems good to themselves, than by compelling each to live as seems good to the rest.",
    "existing_refashioned": "No society in which these liberties are not, on the whole, respected, is free, whatever may be its form of government; and none is completely free in which they do not exist absolute and unqualified. The only freedom which deserves the name, is that of pursuing our own good in our own way, so long as we do not attempt to deprive others of theirs, or impede their efforts to obtain it. Each is the proper guardian of his own health, whether bodily, or mental and spiritual. Humanity gains far more by allowing individuals to live as they judge best for themselves than by forcing everyone to live according to the judgments of others.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.21",
    "chapter": "1",
    "thought": "21",
    "content_type": "",
    "original": "Though this doctrine is anything but new, and, to some persons, may have the air of a truism, there is no doctrine which stands more directly opposed to the general tendency of existing opinion and practice. Society has expended fully as much effort in the attempt (according to its lights) to compel people to conform to its notions of personal, as of social excellence. The ancient commonwealths thought themselves entitled to practise, and the ancient philosophers countenanced, the regulation of every part of private conduct by public authority, on the ground that the State had a deep interest in the whole bodily and mental discipline of every one of its citizens; a mode of thinking which may have been admissible in small republics surrounded by powerful enemies, in constant peril of being subverted by foreign attack or internal commotion, and to which even a short interval of relaxed energy and self-command might so easily be fatal, that they could not afford to wait for the salutary permanent effects of freedom. In the modern world, the greater size of political communities, and above all, the separation between spiritual and temporal authority (which placed the direction of men’s consciences in other hands than those which controlled their worldly affairs), prevented so great an interference by law in the details of private life; but the engines of moral repression have been wielded more strenuously against divergence from the reigning opinion in self-regarding, than even in social matters; religion, the most powerful of the elements which have entered into the formation of moral feeling, having almost always been governed either by the ambition of a hierarchy, seeking control over every department of human conduct, or by the spirit of Puritanism. And some of those modern reformers who have placed themselves in strongest opposition to the religions of the past, have been noway behind either churches or sects in their assertion of the right of spiritual domination: M. Comte, in particular, whose social system, as unfolded in his\nSystème de Politique Positive, aims at establishing (though by moral more than by legal appliances) a despotism of society over the individual, surpassing anything contemplated in the political ideal of the most rigid disciplinarian among the ancient philosophers.",
    "existing_refashioned": "Although this principle is not new, and may even seem obvious to some, almost no society has fully realized or sustained it. It runs counter to the social pressures that naturally arise. Societies have long devoted far more effort to enforcing conformity with prevailing customs than to cultivating the social excellence required to grant individuals genuine liberty.\n\nIn the ancient world, governments and philosophers alike believed the state was entitled to regulate nearly every aspect of private life. They held that the state had a vital interest in shaping the complete physical and mental discipline of its citizens. In small republics surrounded by powerful enemies and continually threatened by invasion or internal unrest, this mindset was understandable. Their survival seemed to depend on constant vigilance and strict self-command, and they felt unable to wait for the slower but more enduring benefits of individual freedom.\n\nIn the modern world, the larger scale of political communities, and especially the separation of spiritual and temporal authority, prevented governments from exercising the same degree of control over private conduct. Yet social pressure rose in its place. Moral repression has often been directed even more harshly against deviations from prevailing opinion in personal matters than in public ones. Religion, one of the strongest forces shaping moral sentiment, has often been driven either by hierarchical ambition to govern every part of life or by a Puritan impulse toward rigid discipline.\n\nNor have modern critics of traditional religion always proved more tolerant. Some reformers, while rejecting the faiths of the past, have claimed an equally sweeping authority over the inner lives of individuals. Auguste Comte is a striking example. His System of Positive Polity envisions a moral despotism of society over the individual even more extensive than anything imagined by the strictest ancient disciplinarians.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.22",
    "chapter": "1",
    "thought": "22",
    "content_type": "",
    "original": "Apart from the peculiar tenets of individual thinkers, there is also in the world at large an increasing inclination to stretch unduly the powers of society over the individual, both by the force of opinion and even by that of legislation: and as the tendency of all the changes taking place in the world is to strengthen society, and diminish the power of the individual, this encroachment is not one of the evils which tend spontaneously to disappear, but, on the contrary, to grow more and more formidable. The disposition of mankind, whether as rulers or as fellow-citizens, to impose their own opinions and inclinations as a rule of conduct on others, is so energetically supported by some of the best and by some of the worst feelings incident to human nature, that it is hardly ever kept under restraint by anything but want of power; and as the power is not declining, but growing, unless a strong barrier of moral conviction can be raised against the mischief, we must expect, in the present circumstances of the world, to see it increase.",
    "existing_refashioned": "With the exception of a few individual thinkers, the world shows a growing tendency to expand society’s authority over the individual through both public opinion and law. Modern developments continually strengthen collective power while weakening individual resistance, so this pressure will not fade on its own; it is likely to intensify.\n\nPeople, whether rulers or ordinary citizens, are naturally inclined to impose their own opinions and preferences on others. This impulse is fueled by both the best and the worst elements of human nature, and it is restrained only when people lack the power to act on it. As society’s power increases, only a strong conviction against such overreach can prevent its continued growth.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  },
  {
    "index": "1.23",
    "chapter": "1",
    "thought": "23",
    "content_type": "",
    "original": "It will be convenient for the argument, if, instead of at once entering upon the general thesis, we confine ourselves in the first instance to a single branch of it, on which the principle here stated is, if not fully, yet to a certain point, recognised by the current opinions. This one branch is the Liberty of Thought: from which it is impossible to separate the cognate liberty of speaking and of writing. Although these liberties, to some considerable amount, form part of the political morality of all countries which profess religious toleration and free institutions, the grounds, both philosophical and practical, on which they rest, are perhaps not so familiar to the general mind, nor so thoroughly appreciated by many even of the leaders of opinion, as might have been expected. Those grounds, when rightly understood, are of much wider application than to only one division of the subject, and a thorough consideration of this part of the question will be found the best introduction to the remainder. Those to whom nothing which I am about to say will be new, may therefore, I hope, excuse me, if on a subject which for now three centuries has been so often discussed, I venture on one discussion more.",
    "existing_refashioned": "Before turning to the full scope of the argument, it is useful to begin with one area where the underlying principle is already acknowledged, at least in part, by prevailing opinion: the liberty of thought, and with it the inseparable liberty of speaking and writing. These freedoms are recognized, to some degree, in every society that claims religious toleration and free institutions. Yet the philosophical and practical reasons that justify them are not as widely understood as one might expect, even among leading voices in public life.\n\nOnce properly grasped, these reasons extend far beyond questions of thought and expression alone. A careful examination of this single branch of liberty will therefore provide the best foundation for understanding the rest. And while the topic has been discussed for centuries, I ask the reader’s patience as I return to it once more.",
    "existing_elegant": "",
    "existing_summary": "",
    "existing_distilled": "",
    "existing_notes": ""
  }
]